# YOLOv8 — GHOST P3-only (UAV Landing H), imgsz=320

nc: 1
depth_multiple: 1.0
width_multiple: 0.5   # có thể giảm 0.4 nếu cần nhanh hơn nữa

backbone:
  # [from, repeats, module, args]
  - [-1, 1, GhostConv, [32, 3, 2]]      # 0: 320 -> 160
  - [-1, 1, GhostConv, [64, 3, 2]]      # 1: 160 -> 80
  - [-1, 1, C2f,       [64, True]]      # 2: giữ 80x80
  - [-1, 1, GhostConv, [128, 3, 2]]     # 3: 80 -> 40 (P3/8)
  - [-1, 1, C2f,       [128, True]]     # 4: P3 feature chính
  - [-1, 1, SPPF,      [128, 5]]        # 5: gom ngữ cảnh toàn cục, vẫn 40x40

head:
  - [5,   1, GhostConv, [96, 1, 1]]     # 6: giảm kênh, nhẹ hơn
  - [-1,  1, C2f,       [96, False]]    # 7: refine feature cho head
  - [[-1], 1, Detect,   [nc]]           # 8: Detect chỉ trên P3 (40x40)
